TEXT = {
    "bot_info": ("Я BeatBoost Bot, с помощью меня можно добавлять ролики в общую базу расширения, "
                 "где собираются все ролики участников для взаимного буста\n\nОграничение: 1 ролик в 2 дня"),
    "membership": ("Уп-с, кажется тебя нет среди участников BeatBoost :(\n\n"
                   "Если у тебя есть пригласительный код из письма об оплате участия, "
                   "пришли его сюда. Код действует один раз."),
    "pausework": "Привет!\n\nНа данный момент бот не принимает заявки :(\n\nПодробнее в основном чате",
    "wrongmessage": ('Кажется, ты ошибся ссылкой. Чтобы добавить ролик, пришли мне ссылку формата\n'
                     '`https://www.youtube.com/watch?v=<id видео>`'
                     '\nили\n'
                     '`https://youtu.be/<id видео>`'),
    "add_success": "Ролик был успешно добавлен в базу BeatBoost Extension. Далее следуй инструкциям из основного чата :)",

    "yourlink": 'Ссылка\n%s\nбыла заменена в базе на\n%s',  # ссылка
    "instruction": ('Для того, чтобы добавить ролик в базу, сделай следующее:\n\n'
                    '1) Загрузи ролик на YouTube\n'
                    '2) Полностью его оптимизируй: название, тэги, описание\n'
                    '3) Обязательно выбери запланированную публикацию ИЛИ настрой премьеру на %s\n'
                    '4) Пришли мне ссылку на премьеру / запланированное видео в ответ на это сообщение'
                    ),  # сегодня / завтра
    "add_error": 'Запись добавить не получилось. Причина:\n%s\nПопробуйте ещё раз',  # ошибка

    "button_repeat_verification": 'Проверить участие ещё раз',
    'start_chat_error': "Ошибка активации:\n",
    "new_room": ("Ваша ссылка на участие.\n\n "
                 "Внимание!!!\n"
                 "Ссылка действительна только один раз.\n"
                 "Никому не передавайте её.\n"
                 "Активированные ссылки не подлежат восстановлению. "
                 "В случае ошибок системы свяжитесь с @dav1dhennessy"),
    "get_invite": "Перейти в подобранный вам чат"

}
